#include QMK_KEYBOARD_H
#include "hokiegeek.h"

extern keymap_config_t keymap_config;

enum custom_keycodes {
    DYNAMIC_MACRO_RANGE = NEW_SAFE_RANGE,
};

#include "dynamic_macro.h"

const uint16_t PROGMEM keymaps[][MATRIX_ROWS][MATRIX_COLS] = {

/* Qwerty
 * ,------------------------------------------     ------------------------------------------.
 * | GEsc |   1  |   2  |   3  |   4  |   5  |     |   6  |   7  |   8  |   9  |   0  | Bksp |
 * |------+------+------+------+------+------+     +------+------+------+------+------+------|
 * | Tab  |   Q  |   W  |   E  |   R  |   T  |     |   Y  |   U  |   I  |   O  |   P  |Enter |
 * |------+------+------+------+------+-------     -------+------+------+------+------+------|
 * | Ctrl |   A  |   S  |   D  |   F  |   G  |     |   H  |   J  |   K  |   L  |   ;  |  '   |
 * |------+------+------+------+------+------|     |------+------+------+------+------+------|
 * | Shift|   Z  |   X  |   C  |   V  |   B  |     |   N  |   M  |   ,  |   .  |   /  |ShEnt |
 * |------+------+------+------+------+------+     +------+------+------+------+------+------|
 * | Lower| MACR | SWAP | Alt  | GUI  |Space |     |Space | TX_N | TX_P | SWAP | Mute |Raise |
 * `------------------------------------------     ------------------------------------------'
 */
[_BASE] = LAYOUT( \
  KC_GESC,     KC_1,            KC_2,    KC_3,    KC_4,     KC_5,         KC_6,    KC_7,       KC_8,       KC_9,    KC_0,     KC_BSPC, \
  KC_TAB,      KC_Q,            KC_W,    KC_E,    KC_R,     KC_T,         KC_Y,    KC_U,       KC_I,       KC_O,    KC_P,     KC_ENT, \
  KC_LCTL,     KC_A,            KC_S,    KC_D,    KC_F,     KC_G,         KC_H,    KC_J,       KC_K,       KC_L,    KC_SCLN,  KC_QUOT, \
  KC_LSFT,     KC_Z,            KC_X,    KC_C,    KC_V,     KC_B,         KC_N,    KC_M,       KC_COMM,    KC_DOT,  KC_SLSH,  KC_SFTENT, \
  TT(_LOWER),  DYN_MACRO_PLAY1, SH_TT,   KC_LALT, KC_LGUI,  KC_SPC,       KC_SPC,  TMUX_NEXT,  TMUX_PREV,  SH_TT,   KC_MUTE,  TT(_RAISE) \
),

/* Lower
 * ,------------------------------------------     ------------------------------------------.
 * |   `  |   ¡  |      |      |      |      |     |      |      |      |   _  |   +  | Del  |
 * |------+------+------+------+------+-------     +------+------+------+------+------+------|
 * |      |      |      |   é  |      |      |     |      |   ú  |   í  |   ó  |   [  |Enter |
 * |------+------+------+------+------+-------     -------+------+------+------+------+------|
 * | Caps |   á  |      |      |      |      |     | Home | PgDn | PgUp | End  |   {  |  |   |
 * |------+------+------+------+------+------|     |------+------+------+------+------+------|
 * | Make |      |      |      |      |      |     |  ñ   |      |      |      |   ¿  |Sysreq|
 * |------+------+------+------+------+------+     +------+------+------+------+------+------|
 * |      |MSTOP |      |      |      |      |     |      |      |      |      | Vol- |      |
 * `------------------------------------------     ------------------------------------------'
 */
[_LOWER] = LAYOUT( \
  KC_GRAVE,   LATIN_IEXC,    _______, _______,  _______, _______,      _______,  _______,  _______,  KC_UNDS,  KC_PLUS,   KC_DEL, \
  _______,    _______,       _______, LATIN_E,  _______, _______,      _______,  LATIN_U,  LATIN_I,  LATIN_O,  KC_LBRC,   _______, \
  KC_CAPS,    LATIN_A,       _______, _______,  _______, _______,      KC_HOME,  KC_PGDN,  KC_PGUP,  KC_END,   KC_LCBR,   KC_PIPE, \
  QMK_MAKE,   _______,       _______, _______,  _______, _______,      LATIN_N,  _______,  _______,  _______,  LATIN_IQS, KC_SYSREQ, \
  _______,    DYN_REC_STOP,  _______, _______,  _______, _______,      _______,  _______,  _______,  _______,  KC_VOLD,   _______ \
),

/* Raise
 * ,------------------------------------------     ------------------------------------------.
 * |      |      |      |      |      |      |     |      |      |      |   -  |   =  | Del  |
 * |------+------+------+------+------+-------     +------+------+------+------+------+------|
 * |      |      |      |      |      |      |     |      |      |      |      |   ]  |Enter |
 * |------+------+------+------+------+-------     -------+------+------+------+------+------|
 * |      |      |      |      |      |      |     | Left | Down |  Up  |Right |   }  |  \   |
 * |------+------+------+------+------+------|     |------+------+------+------+------+------|
 * |  F1  |  F2  |  F3  |  F4  |  F5  |  F6  |     |  F7  |  F8  |  F9  |  F10 | F11  | F12  |
 * |------+------+------+------+------+------+     +------+------+------+------+------+------|
 * |      | MREC |      |      |      |      |     |      | TX_L |TX_PK | Vol+ |      |      |
 * `------------------------------------------     ------------------------------------------'
 */
[_RAISE] = LAYOUT( \
  _______, _______,        _______, _______, _______, _______,      _______, _______,   _______,   KC_MINS, KC_EQL,  KC_DEL, \
  _______, _______,        _______, _______, _______, _______,      _______, _______,   _______,   _______, KC_RBRC, _______, \
  _______, _______,        _______, _______, _______, _______,      KC_LEFT, KC_DOWN,   KC_UP,     KC_RGHT, KC_RCBR, KC_BSLS, \
  KC_F1,   KC_F2,          KC_F3,   KC_F4,   KC_F5,   KC_F6,        KC_F7,   KC_F8,     KC_F9,     KC_F10,  KC_F11,  KC_F12, \
  _______, DYN_REC_START1, _______, _______, _______, _______,      _______, TMUX_LAST, TMUX_PEEK, _______, KC_VOLU, _______ \
),

};

// Each half duplicates the other half
const keypos_t hand_swap_config[MATRIX_ROWS][MATRIX_COLS] = SWAP_HANDS_ORTHO_5X12_SPLIT;

bool process_record_user(uint16_t keycode, keyrecord_t *record) {
    if (!process_record_dynamic_macro(keycode, record)) {
        return false;
    }

    return userspace_process_record_user(keycode, record);
}
